zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rtc.h
#define LL_RTC_TAMPER_ATAMP5IN_ATAMP1OUT  (0u << TAMP_ATCR2_ATOSEL5_Pos)
#define LL_RTC_TAMPER_ATAMP5IN_ATAMP2OUT  (1u << TAMP_ATCR2_ATOSEL5_Pos)
#define LL_RTC_TAMPER_ATAMP5IN_ATAMP3OUT  (2u << TAMP_ATCR2_ATOSEL5_Pos)
#define LL_RTC_TAMPER_ATAMP5IN_ATAMP4OUT  (3u << TAMP_ATCR2_ATOSEL5_Pos)
#define LL_RTC_TAMPER_ATAMP5IN_ATAMP5OUT  (4u << TAMP_ATCR2_ATOSEL5_Pos)
#define LL_RTC_TAMPER_ATAMP5IN_ATAMP6OUT  (5u << TAMP_ATCR2_ATOSEL5_Pos)
#define LL_RTC_TAMPER_ATAMP5IN_ATAMP7OUT  (6u << TAMP_ATCR2_ATOSEL5_Pos)
#define LL_RTC_TAMPER_ATAMP5IN_ATAMP8OUT  (7u << TAMP_ATCR2_ATOSEL5_Pos)

#define LL_RTC_TAMPER_ATAMP6IN_ATAMP1OUT  (0u << TAMP_ATCR2_ATOSEL6_Pos)
#define LL_RTC_TAMPER_ATAMP6IN_ATAMP2OUT  (1u << TAMP_ATCR2_ATOSEL6_Pos)
#define LL_RTC_TAMPER_ATAMP6IN_ATAMP3OUT  (2u << TAMP_ATCR2_ATOSEL6_Pos)
#define LL_RTC_TAMPER_ATAMP6IN_ATAMP4OUT  (3u << TAMP_ATCR2_ATOSEL6_Pos)
#define LL_RTC_TAMPER_ATAMP6IN_ATAMP5OUT  (4u << TAMP_ATCR2_ATOSEL6_Pos)
#define LL_RTC_TAMPER_ATAMP6IN_ATAMP6OUT  (5u << TAMP_ATCR2_ATOSEL6_Pos)
#define LL_RTC_TAMPER_ATAMP6IN_ATAMP7OUT  (6u << TAMP_ATCR2_ATOSEL6_Pos)
#define LL_RTC_TAMPER_ATAMP6IN_ATAMP8OUT  (7u << TAMP_ATCR2_ATOSEL6_Pos)

#define LL_RTC_TAMPER_ATAMP7IN_ATAMP1OUT  (0u << TAMP_ATCR2_ATOSEL7_Pos)
#define LL_RTC_TAMPER_ATAMP7IN_ATAMP2OUT  (1u << TAMP_ATCR2_ATOSEL7_Pos)
#define LL_RTC_TAMPER_ATAMP7IN_ATAMP3OUT  (2u << TAMP_ATCR2_ATOSEL7_Pos)
#define LL_RTC_TAMPER_ATAMP7IN_ATAMP4OUT  (3u << TAMP_ATCR2_ATOSEL7_Pos)
#define LL_RTC_TAMPER_ATAMP7IN_ATAMP5OUT  (4u << TAMP_ATCR2_ATOSEL7_Pos)
#define LL_RTC_TAMPER_ATAMP7IN_ATAMP6OUT  (5u << TAMP_ATCR2_ATOSEL7_Pos)
#define LL_RTC_TAMPER_ATAMP7IN_ATAMP7OUT  (6u << TAMP_ATCR2_ATOSEL7_Pos)
#define LL_RTC_TAMPER_ATAMP7IN_ATAMP8OUT  (7u << TAMP_ATCR2_ATOSEL7_Pos)

#define LL_RTC_TAMPER_ATAMP8IN_ATAMP1OUT  (0u << TAMP_ATCR2_ATOSEL8_Pos)
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP2OUT  (1u << TAMP_ATCR2_ATOSEL8_Pos)
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP3OUT  (2u << TAMP_ATCR2_ATOSEL8_Pos)
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP4OUT  (3u << TAMP_ATCR2_ATOSEL8_Pos)
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP5OUT  (4u << TAMP_ATCR2_ATOSEL8_Pos)
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP6OUT  (5u << TAMP_ATCR2_ATOSEL8_Pos)
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP7OUT  (6u << TAMP_ATCR2_ATOSEL8_Pos)
#define LL_RTC_TAMPER_ATAMP8IN_ATAMP8OUT  (7u << TAMP_ATCR2_ATOSEL8_Pos)
/**
  * @}
  */

/** @defgroup RTC_LL_EC_BKP  BACKUP
  * @{
  */
#define LL_RTC_BKP_NUMBER                  RTC_BKP_NB
#define LL_RTC_BKP_DR0                     0U
#define LL_RTC_BKP_DR1                     1U
#define LL_RTC_BKP_DR2                     2U
#define LL_RTC_BKP_DR3                     3U
#define LL_RTC_BKP_DR4                     4U
#define LL_RTC_BKP_DR5                     5U
#define LL_RTC_BKP_DR6                     6U
#define LL_RTC_BKP_DR7                     7U
#define LL_RTC_BKP_DR8                     8U
#define LL_RTC_BKP_DR9                     9U
#define LL_RTC_BKP_DR10                    10U
#define LL_RTC_BKP_DR11                    11U
#define LL_RTC_BKP_DR12                    12U
#define LL_RTC_BKP_DR13                    13U
#define LL_RTC_BKP_DR14                    14U
#define LL_RTC_BKP_DR15                    15U
#define LL_RTC_BKP_DR16                    16U
#define LL_RTC_BKP_DR17                    17U
#define LL_RTC_BKP_DR18                    18U
#define LL_RTC_BKP_DR19                    19U
#define LL_RTC_BKP_DR20                    20U
#define LL_RTC_BKP_DR21                    21U
#define LL_RTC_BKP_DR22                    22U
#define LL_RTC_BKP_DR23                    23U
#define LL_RTC_BKP_DR24                    24U
#define LL_RTC_BKP_DR25                    25U
#define LL_RTC_BKP_DR26                    26U
#define LL_RTC_BKP_DR27                    27U
#define LL_RTC_BKP_DR28                    28U
#define LL_RTC_BKP_DR29                    29U
#define LL_RTC_BKP_DR30                    30U
#define LL_RTC_BKP_DR31                    31U
#define LL_RTC_BKP_DR32                    32U
#define LL_RTC_BKP_DR33                    33U
#define LL_RTC_BKP_DR34                    34U
#define LL_RTC_BKP_DR35                    35U
#define LL_RTC_BKP_DR36                    36U
#define LL_RTC_BKP_DR37                    37U
#define LL_RTC_BKP_DR38                    38U
#define LL_RTC_BKP_DR39                    39U
#define LL_RTC_BKP_DR40                    40U
#define LL_RTC_BKP_DR41                    41U
#define LL_RTC_BKP_DR42                    42U
#define LL_RTC_BKP_DR43                    43U
#define LL_RTC_BKP_DR44                    44U
#define LL_RTC_BKP_DR45                    45U
#define LL_RTC_BKP_DR46                    46U
#define LL_RTC_BKP_DR47                    47U
#define LL_RTC_BKP_DR48                    48U
#define LL_RTC_BKP_DR49                    49U
#define LL_RTC_BKP_DR50                    50U
#define LL_RTC_BKP_DR51                    51U
#define LL_RTC_BKP_DR52                    52U
#define LL_RTC_BKP_DR53                    53U
#define LL_RTC_BKP_DR54                    54U
#define LL_RTC_BKP_DR55                    55U
#define LL_RTC_BKP_DR56                    56U
#define LL_RTC_BKP_DR57                    57U
#define LL_RTC_BKP_DR58                    58U
#define LL_RTC_BKP_DR59                    59U
#define LL_RTC_BKP_DR60                    60U
#define LL_RTC_BKP_DR61                    61U
#define LL_RTC_BKP_DR62                    62U
#define LL_RTC_BKP_DR63                    63U
#define LL_RTC_BKP_DR64                    64U
#define LL_RTC_BKP_DR65                    65U
#define LL_RTC_BKP_DR66                    66U
#define LL_RTC_BKP_DR67                    67U
#define LL_RTC_BKP_DR68                    68U
#define LL_RTC_BKP_DR69                    69U
#define LL_RTC_BKP_DR70                    70U
#define LL_RTC_BKP_DR71                    71U
#define LL_RTC_BKP_DR72                    72U
#define LL_RTC_BKP_DR73                    73U
#define LL_RTC_BKP_DR74                    74U
#define LL_RTC_BKP_DR75                    75U
#define LL_RTC_BKP_DR76                    76U
#define LL_RTC_BKP_DR77                    77U
#define LL_RTC_BKP_DR78                    78U
#define LL_RTC_BKP_DR79                    79U
#define LL_RTC_BKP_DR80                    80U
#define LL_RTC_BKP_DR81                    81U
#define LL_RTC_BKP_DR82                    82U
#define LL_RTC_BKP_DR83                    83U
#define LL_RTC_BKP_DR84                    84U
#define LL_RTC_BKP_DR85                    85U
#define LL_RTC_BKP_DR86                    86U
#define LL_RTC_BKP_DR87                    87U
#define LL_RTC_BKP_DR88                    88U
#define LL_RTC_BKP_DR89                    89U
#define LL_RTC_BKP_DR90                    90U
#define LL_RTC_BKP_DR91                    91U
#define LL_RTC_BKP_DR92                    92U
#define LL_RTC_BKP_DR93                    93U
#define LL_RTC_BKP_DR94                    94U
#define LL_RTC_BKP_DR95                    95U
#define LL_RTC_BKP_DR96                    96U
#define LL_RTC_BKP_DR97                    97U
#define LL_RTC_BKP_DR98                    98U
#define LL_RTC_BKP_DR99                    99U
#define LL_RTC_BKP_DR100                   100U
#define LL_RTC_BKP_DR101                   101U
#define LL_RTC_BKP_DR102                   102U
#define LL_RTC_BKP_DR103                   103U
#define LL_RTC_BKP_DR104                   104U
#define LL_RTC_BKP_DR105                   105U
#define LL_RTC_BKP_DR106                   106U
#define LL_RTC_BKP_DR107                   107U
#define LL_RTC_BKP_DR108                   108U
#define LL_RTC_BKP_DR109                   109U
#define LL_RTC_BKP_DR110                   110U
#define LL_RTC_BKP_DR111                   111U
#define LL_RTC_BKP_DR112                   112U
#define LL_RTC_BKP_DR113                   113U
#define LL_RTC_BKP_DR114                   114U
#define LL_RTC_BKP_DR115                   115U
#define LL_RTC_BKP_DR116                   116U
#define LL_RTC_BKP_DR117                   117U
#define LL_RTC_BKP_DR118                   118U
#define LL_RTC_BKP_DR119                   119U
#define LL_RTC_BKP_DR120                   120U
#define LL_RTC_BKP_DR121                   121U
#define LL_RTC_BKP_DR122                   122U
#define LL_RTC_BKP_DR123                   123U
#define LL_RTC_BKP_DR124                   124U
#define LL_RTC_BKP_DR125                   125U
#define LL_RTC_BKP_DR126                   126U
#define LL_RTC_BKP_DR127                   127U

/**
  * @}
  */

