zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/drivers/include/stm32mp2xx_ll_rtc.h
  * @retval None
  */
__STATIC_INLINE void LL_RTC_SetRtcSecure(RTC_TypeDef *RTCx, uint32_t rtcSecure)
{
  MODIFY_REG(RTCx->SECCFGR,
             RTC_SECCFGR_SEC | RTC_SECCFGR_INITSEC | RTC_SECCFGR_CALSEC | RTC_SECCFGR_TSSEC | RTC_SECCFGR_WUTSEC |
             RTC_SECCFGR_ALRASEC | RTC_SECCFGR_ALRBSEC, rtcSecure);
}
#endif /* #if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/**
  * @brief  Get RTC secure level.
  * @note   Unsecure features is relevant if LL_RTC_SECURE_FULL_NO.
  * @rmtoll RTC_SECCFGR           SEC           LL_RTC_SetRtcSecure
  * @rmtoll RTC_SECCFGR           INITPROT          LL_RTC_SetRtcSecure
  * @rmtoll RTC_SECCFGR           CALSEC          LL_RTC_SetRtcSecure
  * @rmtoll RTC_SECCFGR           TSSEC           LL_RTC_SetRtcSecure
  * @rmtoll RTC_SECCFGR           WUTSEC          LL_RTC_SetRtcSecure
  * @rmtoll RTC_SECCFGR           ALRASEC         LL_RTC_SetRtcSecure
  * @rmtoll RTC_SECCFGR           ALRBSEC         LL_RTC_SetRtcSecure
  * @param  RTCx RTC Instance
  * @retval Combination of the following values:
  *         @arg @ref LL_RTC_SECURE_FULL_YES
  *         @arg @ref LL_RTC_SECURE_FULL_NO
  *         @arg @ref LL_RTC_UNSECURE_FEATURE_INIT
  *         @arg @ref LL_RTC_UNSECURE_FEATURE_CAL
  *         @arg @ref LL_RTC_UNSECURE_FEATURE_TS
  *         @arg @ref LL_RTC_UNSECURE_FEATURE_WUT
  *         @arg @ref LL_RTC_UNSECURE_FEATURE_ALRA
  *         @arg @ref LL_RTC_UNSECURE_FEATURE_ALRB
  */
__STATIC_INLINE uint32_t LL_RTC_GetRtcSecure(const RTC_TypeDef *RTCx)
{
  return READ_BIT(RTCx->SECCFGR,
                  RTC_SECCFGR_SEC | RTC_SECCFGR_INITSEC | RTC_SECCFGR_CALSEC | RTC_SECCFGR_TSSEC | RTC_SECCFGR_WUTSEC |
                  RTC_SECCFGR_ALRASEC | RTC_SECCFGR_ALRBSEC);
}

#if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)
/**
  * @brief  Set TAMPER secure level.
  * @rmtoll TAMP_SECCFGR          TAMPSEC           LL_RTC_SetTampSecure
  * @param  RTCx RTC Instance
  * @param  tampSecure This parameter can be one of the following values:
  *         @arg @ref LL_TAMP_SECURE_FULL_YES
  *         @arg @ref LL_TAMP_SECURE_FULL_NO
  * @retval None
  */
__STATIC_INLINE void LL_RTC_SetTampSecure(RTC_TypeDef *RTCx, uint32_t tampSecure)
{
  UNUSED(RTCx);
  MODIFY_REG(TAMP->SECCFGR, TAMP_SECCFGR_TAMPSEC, tampSecure);
}
#endif /* #if defined (__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U) */

/**
  * @brief  Get TAMPER secure level.
  * @rmtoll TAMP_SECCFGR          TAMPSEC           LL_RTC_GetTampSecure
  * @param  RTCx RTC Instance
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_TAMP_SECURE_FULL_YES
  *         @arg @ref LL_TAMP_SECURE_FULL_NO
  */
__STATIC_INLINE uint32_t LL_RTC_GetTampSecure(const RTC_TypeDef *RTCx)
{
  UNUSED(RTCx);
  return READ_BIT(TAMP->SECCFGR, TAMP_SECCFGR_TAMPSEC);
}

/**
  * @}
  */

/** @defgroup RTC_LL_EF_PRIVILEGE PRIVILEGE_Management
  * @{
  */

/**
  * @brief  Set RTC privilege level.
  * @note   Privilege features are relevant if LL_RTC_PRIVILEGE_FULL_NO.
  * @rmtoll RTC_PRIVCR           PRIV              LL_RTC_SetRtcPrivilege
  * @rmtoll RTC_PRIVCR           INITPRIV          LL_RTC_SetRtcPrivilege
  * @rmtoll RTC_PRIVCR           CALPRIV           LL_RTC_SetRtcPrivilege
  * @rmtoll RTC_PRIVCR           TSPRIV            LL_RTC_SetRtcPrivilege
  * @rmtoll RTC_PRIVCR           WUTPRIV           LL_RTC_SetRtcPrivilege
  * @rmtoll RTC_PRIVCR           ALRAPRIV          LL_RTC_SetRtcPrivilege
  * @rmtoll RTC_PRIVCR           ALRBPRIV          LL_RTC_SetRtcPrivilege
  * @param  RTCx RTC Instance
  * @param  rtcPrivilege This parameter can be a combination of the following values:
  *         @arg @ref LL_RTC_PRIVILEGE_FULL_YES
  *         @arg @ref LL_RTC_PRIVILEGE_FULL_NO
  *         @arg @ref LL_RTC_PRIVILEGE_FEATURE_INIT
  *         @arg @ref LL_RTC_PRIVILEGE_FEATURE_CAL
  *         @arg @ref LL_RTC_PRIVILEGE_FEATURE_TS
  *         @arg @ref LL_RTC_PRIVILEGE_FEATURE_WUT
  *         @arg @ref LL_RTC_PRIVILEGE_FEATURE_ALRA
  *         @arg @ref LL_RTC_PRIVILEGE_FEATURE_ALRB
  * @retval None
  */
__STATIC_INLINE void LL_RTC_SetRtcPrivilege(RTC_TypeDef *RTCx, uint32_t rtcPrivilege)
{
  MODIFY_REG(RTCx->PRIVCR, RTC_PRIVCR_PRIV | RTC_PRIVCR_INITPRIV | RTC_PRIVCR_CALPRIV | RTC_PRIVCR_TSPRIV |
             RTC_PRIVCR_WUTPRIV | RTC_PRIVCR_ALRAPRIV | RTC_PRIVCR_ALRBPRIV, rtcPrivilege);
}

/**
  * @brief  Get RTC privilege level.
  * @note   Privilege features are relevant if LL_RTC_PRIVILEGE_FULL_NO.
  * @rmtoll RTC_PRIVCR           PRIV              LL_RTC_SetRtcPrivilege
  * @rmtoll RTC_PRIVCR           INITPRIV          LL_RTC_SetRtcPrivilege
  * @rmtoll RTC_PRIVCR           CALPRIV           LL_RTC_SetRtcPrivilege
  * @rmtoll RTC_PRIVCR           TSPRIV            LL_RTC_SetRtcPrivilege
  * @rmtoll RTC_PRIVCR           WUTPRIV           LL_RTC_SetRtcPrivilege
  * @rmtoll RTC_PRIVCR           ALRAPRIV          LL_RTC_SetRtcPrivilege
  * @rmtoll RTC_PRIVCR           ALRBPRIV          LL_RTC_SetRtcPrivilege
  * @param  RTCx RTC Instance
  * @retval Combination of the following values:
  *         @arg @ref LL_RTC_PRIVILEGE_FULL_YES
  *         @arg @ref LL_RTC_PRIVILEGE_FULL_NO
  *         @arg @ref LL_RTC_PRIVILEGE_FEATURE_INIT
  *         @arg @ref LL_RTC_PRIVILEGE_FEATURE_CAL
  *         @arg @ref LL_RTC_PRIVILEGE_FEATURE_TS
  *         @arg @ref LL_RTC_PRIVILEGE_FEATURE_WUT
  *         @arg @ref LL_RTC_PRIVILEGE_FEATURE_ALRA
  *         @arg @ref LL_RTC_PRIVILEGE_FEATURE_ALRB
  */
__STATIC_INLINE uint32_t LL_RTC_GetRtcPrivilege(const RTC_TypeDef *RTCx)
{
  return READ_BIT(RTCx->PRIVCR,
                  RTC_PRIVCR_PRIV | RTC_PRIVCR_INITPRIV | RTC_PRIVCR_CALPRIV | RTC_PRIVCR_TSPRIV | RTC_PRIVCR_WUTPRIV |
                  RTC_PRIVCR_ALRAPRIV | RTC_PRIVCR_ALRBPRIV);
}

/**
  * @brief  Set TAMPER privilege level.
  * @rmtoll TAMP_SECCFGR          TAMPPRIV           LL_RTC_SetTampPrivilege
  * @param  RTCx RTC Instance
  * @param  tampPrivilege This parameter can be one of the following values:
  *         @arg @ref LL_TAMP_PRIVILEGE_FULL_YES
  *         @arg @ref LL_TAMP_PRIVILEGE_FULL_NO
  * @retval None
  */
__STATIC_INLINE void LL_RTC_SetTampPrivilege(const RTC_TypeDef *RTCx, uint32_t tampPrivilege)
{
  UNUSED(RTCx);
  MODIFY_REG(TAMP->PRIVCR, TAMP_PRIVCR_TAMPPRIV, tampPrivilege);
}

/**
  * @brief  Get TAMPER privilege level.
  * @rmtoll TAMP_SECCFGR          TAMPSEC           LL_RTC_GetTampPrivilege
  * @param  RTCx RTC Instance
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_TAMP_PRIVILEGE_FULL_YES
  *         @arg @ref LL_TAMP_PRIVILEGE_FULL_NO
  */
__STATIC_INLINE uint32_t LL_RTC_GetTampPrivilege(const RTC_TypeDef *RTCx)
{
  UNUSED(RTCx);
  return READ_BIT(TAMP->PRIVCR, TAMP_PRIVCR_TAMPPRIV);
}

/**
  * @brief  Set Backup Registers privilege level.
  * @note   bckupRegisterPrivilege is only writable in secure mode or if trustzone is disabled
  * @rmtoll TAMP_PRIVCR          BKPWPRIV           LL_RTC_SetTampPrivilege
  * @rmtoll TAMP_PRIVCR          BKPRWPRIV          LL_RTC_SetTampPrivilege
  * @param  RTCx RTC Instance
  * @param  bckupRegisterPrivilege This parameter can be one of the following values:
  *         @arg @ref LL_RTC_PRIVILEGE_BKUP_ZONE_NONE
  *         @arg @ref LL_RTC_PRIVILEGE_BKUP_ZONE_1
  *         @arg @ref LL_RTC_PRIVILEGE_BKUP_ZONE_2
  *         @arg @ref LL_RTC_PRIVILEGE_BKUP_ZONE_ALL
  * @retval None
  */
__STATIC_INLINE void LL_RTC_SetBackupRegisterPrivilege(const RTC_TypeDef *RTCx, uint32_t bckupRegisterPrivilege)
{
  UNUSED(RTCx);
  MODIFY_REG(TAMP->PRIVCR, (TAMP_PRIVCR_BKPWPRIV | TAMP_PRIVCR_BKPRWPRIV), bckupRegisterPrivilege);
}

/**
  * @brief  Get Backup Registers privilege level.
  * @rmtoll TAMP_PRIVCR          BKPWPRIV           LL_RTC_SetTampPrivilege
  * @rmtoll TAMP_PRIVCR          BKPRWPRIV          LL_RTC_SetTampPrivilege
  * @param  RTCx RTC Instance
  * @retval This parameter can be one of the following values:
  *         @arg @ref LL_RTC_PRIVILEGE_BKUP_ZONE_NONE
  *         @arg @ref LL_RTC_PRIVILEGE_BKUP_ZONE_1
  *         @arg @ref LL_RTC_PRIVILEGE_BKUP_ZONE_2
  *         @arg @ref LL_RTC_PRIVILEGE_BKUP_ZONE_ALL
  */
__STATIC_INLINE uint32_t LL_RTC_GetBackupRegisterPrivilege(const RTC_TypeDef *RTCx)
{
  UNUSED(RTCx);
  return READ_BIT(TAMP->PRIVCR, (TAMP_PRIVCR_BKPWPRIV | TAMP_PRIVCR_BKPRWPRIV));
}
/**
  * @}
  */

